---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarHandleType.Undefined
enum: Autodesk.Revit.DB.Structure.RebarHandleType
source: html/0773859c-5f30-3fb4-25b3-34c80432aaa4.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleType.Undefined

represents an undefined handle. if this value is returned, then the handle cannot find it's type